yuleihua/illumos-omnios/usr/src/man/man5/brands.5
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 2019 OmniOS Community Edition (OmniOSce) Association.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH BRANDS 5 "mar 25, 2019"
.SH NAME
brands \- alternate operating environments for non-global zones
.SH DESCRIPTION
.LP
The branded zone (BrandZ) framework extends the Solaris Zones infrastructure
described in \fBzones\fR(5) to include the creation of brands, which provide
non-global zones that contain non-native operating environments.
.sp
.LP
The term "brand" can refer to a wide range of operating environments. All brand
management is performed as extensions to the current zones structure.
.sp
.LP
Every zone is configured with an associated brand. The brand type is used to
determine which scripts are executed when a zone is installed and booted. In
addition, a zone's brand is used to properly identify the correct application
type at application launch time.  The default brand is determined by the
installed distribution in the global zone.
.sp
.LP
A branded zone will support exactly one brand of non-native binary, which means
that a branded zone provides a single operating environment. Once a zone has
been assigned a brand, that brand cannot be changed or removed.
.sp
.LP
BrandZ extends the zones tools in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
A brand is an attribute of a zone, set at zone create time.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zonecfg tool (see \fBzonecfg\fR(1M)) is used to set a zone's brand type and
configure the zone.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zoneadm tool (see \fBzoneadm\fR(1M)) is used to report a zone's brand type
and administer the zone.
.RE
.SS "Device Support"
.LP
The devices supported by each zone are documented in the man pages and other
documentation for that brand. The zones infrastructure detects any attempt to
add an unsupported device and issues a warning to the administrator. If the
administrator chooses to add an unsupported device despite that warning, that
device might or might not work as expected. The configuration will be untested
and unsupported.
.SS "Available Brands"
Refer to the brand-specific manual page for further details.
.TS
expand box;
c | c
lB | l .
BRAND	DESCRIPTION
_
ipkg	Runs a full copy of OmniOS with independently managed
	software.
_
lipkg	As \fBipkg\fR but with system software linked to that
	in the global zone.
_
sparse	An \fBlipkg\fR zone which has several filesystems
	directly shared with the global zone. \fBsparse\fR
	zones are very small and quick to build.
_
pkgsrc	A \fBsparse\fR zone which is pre-configured to use
	Joyent's binary package repository.
_
lx	An environment for running binary applications built
	for Gnu/Linux.
_
bhyve	A virtual machine instance running under the \fIbhyve\fR
	hypervisor.
_
kvm	A virtual machine instance running under the \fIKVM\fR
	hypervisor.
_
illumos	An independent illumos environment running under the
	shared OmniOS kernel.
.TE
.sp
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.LP
\fBmdb\fR(1), \fBzlogin\fR(1), \fBzonename\fR(1), \fBdtrace\fR(1M),
\fBin.rlogind\fR(1M), \fBsshd\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M),
\fBkill\fR(2), \fBpriocntl\fR(2), \fBgetzoneid\fR(3C), \fBucred_get\fR(3C),
\fBgetzoneid\fR(3C), \fBproc\fR(4), \fBattributes\fR(5), \fBlx\fR(5),
\fBprivileges\fR(5), \fBzones\fR(5), \fBcrgetzoneid\fR(9F),
\fBipkg\fR(5), \fBlipkg\fR(5), \fBsparse\fR(5), \fBpkgsrc\fR(5),
\fBlx\fR(5), \fBbhyve\fR(5), \fBkvm\fR(5), \fBillumos\fR(5)
