yuleihua/illumos-omnios/usr/src/man/man5/kvm.5
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\" Copyright 2016, Joyent, Inc.
.\" Copyright 2016, OmniTI Computer Consulting, Inc. All Rights Reserved.
.\" Copyright 2019 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 25, 2019
.Dt KVM 5
.Os
.Sh NAME
.Nm kvm
.Nd zone brand for running a virtual machine instance under the KVM hypervisor
.Sh DESCRIPTION
An
.Em kvm
branded zone
uses the
.Xr brands 5
framework to provide an environment for running a virtual machine under the
KVM hypervisor.
.Sh CONFIGURATION
An example
.Em kvm
zone is shown below:
.sp
.Bd -literal -offset indent
create -t kvm
set zonepath=/zones/kvm
add net
    set allowed-address=10.0.0.112/24
    set physical=vm0
end
add device
    set match=/dev/zvol/rdsk/rpool/kvm0
end
add attr
    set name=ram
    set type=string
    set value=2G
end
add attr
    set name=vcpus
    set type=string
    set value=8
end
add attr
    set name=bootdisk
    set type=string
    set value=rpool/kvm0
end
add fs
    set dir=/rpool/iso/debian-9.4.0-amd64-netinst.iso
    set special=/rpool/iso/debian-9.4.0-amd64-netinst.iso
    set type=lofs
    add options ro
    add options nodevices
end
add attr
    set name=cdrom
    set type=string
    set value=/rpool/iso/debian-9.4.0-amd64-netinst.iso
end
.Ed
.sp
.Sh SEE ALSO
.Xr mdb 1 ,
.Xr proc 1 ,
.Xr dtrace 1m ,
.Xr zfs 1m ,
.Xr zoneadm 1m ,
.Xr zonecfg 1m ,
.Xr brands 5 ,
.Xr privileges 5 ,
.Xr resource_controls 5 ,
.Xr zones 5
